app/Controllers/EmployeeController.php

SELECT *
FROM `employees`
---
    public function index()
    {
        $employee = new Employee();
        $data['employee'] = $employee->findAll();

INSERT INTO `employees` (`first_name`, `last_name`, `phone`, `email`, `designation`) VALUES ('dummy', 'data', '1111111111', 'dummydata@gmail.com', 'dummy data')
---
    public function store(){
        $employee = new Employee();
        $data = [
            'first_name' => $this->request->getPost('first_name'),
            'last_name' => $this->request->getPost('last_name'),
            'phone' => $this->request->getPost('phone'),
            'email' => $this->request->getPost('email'),
            'designation' => $this->request->getPost('designation'),
        ];
        $employee->save($data);

SELECT *
FROM `employees`
WHERE `employees`.`id` = '8'
---
    public function edit($id){
        $employee = new Employee();
        $data['employee'] = $employee->find($id);

DELETE FROM `employees`
WHERE `id` IN ('6')
---
    public function delete($id){
        $employee = new Employee();
        $employee->delete($id);